app/controllers/addon_controller.rb

  def list
    @addons = Addon.paginate :page => params[:page]||1, :per_page => 10,
      :conditions => ["user_id = ?",session[:user_id]]
---
SELECT * FROM `addons` WHERE (user_id = 1) LIMIT 0, 10