app/controllers/admin_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def index
    @user = User.find(session[:user_id])