app/controllers/customer_controller.rb

  def list
    if params[:search]
      @customers = Customer.paginate :page => params[:page]||1, :per_page => 10,
          :conditions => ["name like ? && user_id = ?","%#{params[:search]}%",
              session[:user_id]],
          :order => "created_at desc"
---
SELECT * FROM `customers` WHERE (user_id = 1) ORDER BY created_at desc LIMIT 0, 10