app/controllers/document_controller.rb

SELECT * FROM `documents` LIMIT 0, 1
---
  def list
    @documents = Document.paginate :page => params[:page]||1, :per_page => 1