app/controllers/price_controller.rb

  def list
    @prices = Price.paginate :per_page => 10,
      :conditions => ["user_id = ?",session[:user_id]],
      :page => params[:page] || 1
---
SELECT * FROM `prices` WHERE (user_id = 1) LIMIT 0, 10