app/controllers/property_controller.rb

SELECT count(*) AS count_all FROM `properties` WHERE (user_id = 1)
---
  def list
    if Property.count(:conditions => ["user_id = ?", session[:user_id]]) == 0

SELECT * FROM `properties` WHERE (user_id = 1) LIMIT 1
---
  def public_code
    @user_id = session[:user_id]
    @property = Property.find(:first, :conditions => ["user_id = ?", session[:user_id]])