app/controllers/room_controller.rb

  def list
    @rooms = Room.paginate :per_page => 10,
      :conditions => ["user_id = ?",session[:user_id]],
      :page => params[:page] || 1
---
SELECT * FROM `rooms` WHERE (user_id = 1) LIMIT 0, 10

  def new
    @room = Room.new
    if (@properties = Property.find(:all, :conditions => ["user_id = ?",session[:user_id]])).length == 0
---
SELECT * FROM `properties` WHERE (user_id = 1)