app/controllers/user_controller.rb

  def edit
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)