app/controllers/user_admin_controller.rb

  def index
    #@total_orders   = Order.count
    #@pending_orders = Order.count_pending

    @user = User.find(session[:user_id])
    @contract_count = Contract.count(:conditions => ["user_id = ?",session[:user_id]])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT count(*) AS count_all FROM `contracts` WHERE (user_id = 2)